app/Controllers/ClientesController.php

    public function index(){
        //$cliente=new ClientesModel();
        //$datosCli['cliente']=$cliente->getClientes();

        $pager = service('pager');
        $model = new ClientesModel();

        $data = [
            'cliente' => $model->paginate(8, 'group1'),
            'pager' => $model->pager
        ];
---
SELECT *
FROM `cliente`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `cliente`