app/Controllers/HabitacionController.php

SELECT *
FROM `habitacion`
JOIN `tipo_habitacion` ON `tipo_habitacion`.`idTipo` = `habitacion`.`idTipo`
JOIN `estado_hab` ON `estado_hab`.`idEstado` = `habitacion`.`idEstado`
ORDER BY `idHab` ASC
 LIMIT 8, 8
SELECT COUNT(*) AS `numrows`
FROM `habitacion`
JOIN `tipo_habitacion` ON `tipo_habitacion`.`idTipo` = `habitacion`.`idTipoHab`
JOIN `estado_hab` ON `estado_hab`.`idEstado` = `habitacion`.`idEstado`
---
    public function index(){

       // $datosHab['habitacion']=$habitacion->getAll();

       $pager = service('pager');
       $model = new HabitacionModel();

       $data = [
           'habitacion' => $model->join('tipo_habitacion', 'tipo_habitacion.idTipo = habitacion.idTipo')
           ->join('estado_hab', 'estado_hab.idEstado = habitacion.idEstado')
           ->orderBy('idHab','ASC')->paginate(8, 'group1'),
           'pager' => $model->pager
       ];

SELECT *
FROM `habitacion`
WHERE `idHab` = '13'
 LIMIT 1
---
    public function editar($id=null){

        $tipoHab=new TipoHabModel();
        $hab=new HabitacionModel();

        $datos['tipo']=$tipoHab->getTipo();
        $datos['hab']=$hab->where('idHab',$id)->first();