app/Controllers/UsuariosController.php

    public function index(){
        //$usuario=new UsuariosModel();
        //$datosUsuario['usuario']=$usuario->getUsuarios();

        $msg = session('msg');
        $pager = service('pager');
        $model = new UsuariosModel();

        $data = [
            'usuario' => $model->paginate(8, 'group1'),
            'pager' => $model->pager
        ];
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL