app/Models/ClientesModel.php

SELECT *
FROM `cliente`
---
    public function obtenerCliente($data){
        $cliente=$this->db->table('cliente as c');
        $cliente->select('c.dni, c.nombre');
        $cliente->where($data);
        return $cliente->get()->getResultArray();