app/Models/HabitacionModel.php

    public function innerJoinTipoHab()
    {
        $builder = $this->db->table("habitacion as hab");
        $builder->select('hab.*, tipoHab.tipo as tipo_hab');
        $builder->join('tipo_habitacion as tipoHab', 'hab.idTipoHab = tipoHab.idTipo');
        $builder->orderBy('idHab','ASC');
        $data = $builder->get()->getResultArray();
---
SELECT `hab`.*, `tipoHab`.`tipo` as `tipo_hab`
FROM `habitacion` as `hab`
JOIN `tipo_habitacion` as `tipoHab` ON `hab`.`idTipoHab` = `tipoHab`.`idTipo`
ORDER BY `idHab` ASC

    public function countEstadoHab(){
        $con=$this->db->table("habitacion as h");
        $con->select('e.idEstado,e.estado, count(h.idEstado) as cantidad');
        $con->join('estado_hab e','h.idEstado=e.idEstado','right');
        $con->groupBy('e.estado')->orderBy('e.idEstado','ASC');
        $data = $con->get()->getResultArray();
---
SELECT `e`.`idEstado`, `e`.`estado`, count(e.estado) as cantidad
FROM `habitacion` as `h`
RIGHT JOIN `estado_hab` `e` ON `h`.`idEstado`=`e`.`idEstado`
GROUP BY `e`.`estado`
ORDER BY `e`.`idEstado` ASC

    public function getAll(){
        $builder = $this->db->table("habitacion as hab");
        $builder->select('hab.*, estado_hab.estado, tipoHab.*');
        $builder->join('estado_hab', 'hab.idEstado = estado_hab.idEstado');
        $builder->join('tipo_habitacion as tipoHab', 'hab.idTipoHab = tipoHab.idTipo');
        $builder->orderBy('idHab','ASC');
        $data = $builder->get()->getResultArray();
---
SELECT `hab`.*, `estado_hab`.`estado`, `tipoHab`.*
FROM `habitacion` as `hab`
JOIN `estado_hab` ON `hab`.`idEstado` = `estado_hab`.`idEstado`
JOIN `tipo_habitacion` as `tipoHab` ON `hab`.`idTipoHab` = `tipoHab`.`idTipo`
ORDER BY `idHab` ASC