app/Models/TipoHabModel.php

SELECT *
FROM `tipo_habitacion`
---
    public function getTipoHab($dato=null){
        $tipo=$this->db->table('tipo_habitacion as th');
        $tipo->where("th.deleted_at IS NULL");
        if(!empty($dato)){
            $tipo->like('th.tipo',$dato);
        }
        return $tipo->get()->getResultArray();