app/Models/UsuariosModel.php

SELECT `u`.`id`, `u`.`username`, `u`.`pass`, `u`.`nombre`, `roles`.`cargo`
FROM `usuarios` as `u`
JOIN `roles` ON `u`.`idRol` = `roles`.`idRol`
WHERE `username` = 'admin'
---
    public function obtenerUsuario($data){
        $user=$this->db->table('usuarios as u');
        $user->select('u.id,u.username, u.pass, u.nombre, roles.cargo');
        $user->join('roles', 'u.idRol = roles.idRol');
        $user->where($data);
        return $user->get()->getResultArray();

SELECT `u`.*, `r`.`cargo`
FROM `usuarios` as `u`
JOIN `roles` as `r` ON `u`.`idRol` = `r`.`idRol`
WHERE `u`.`id` = '1'
---
    public function obtenerDatos($id){
        $user=$this->db->table('usuarios as u');
        $user->select('u.*, r.cargo');
        $user->join('roles as r', 'u.idRol = r.idRol');
        $user->where('u.id',$id);
        return $user->get()->getRowArray();